Revit 2027 API
AddInId.GetGUID Method
 value of the AddInId as a GUID
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetGUID()
Public Function GetGUID As Guid
public:
Guid GetGUID()
member GetGUID : unit -> Guid
Return Value
Guid
 GUID value of the AddInId
See Also
Reference
AddInId Class
Autodesk.Revit.DB Namespace